; domain
(define (domain logistics)
  (:requirements :strips :typing) 
  (:types truck
          airplane - vehicle
          package
          vehicle - physobj
          airport
          location - place
          city
          place 
          physobj - object)
  
  (:predicates  (in-city ?loc - place ?city - city)
    (at ?obj - physobj ?loc - place)
    (in ?pkg - package ?veh - vehicle))
  
(:action LOAD-TRUCK
   :parameters    (?pkg - package ?truck - truck ?loc - place)
   :precondition  (and (at ?truck ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?truck)))

(:action LOAD-AIRPLANE
  :parameters   (?pkg - package ?airplane - airplane ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?airplane)))

(:action UNLOAD-TRUCK
  :parameters   (?pkg - package ?truck - truck ?loc - place)
  :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
  :effect       (and (not (in ?pkg ?truck)) (at ?pkg ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters    (?pkg - package ?airplane - airplane ?loc - place)
  :precondition  (and (in ?pkg ?airplane) (at ?airplane ?loc))
  :effect        (and (not (in ?pkg ?airplane)) (at ?pkg ?loc)))

(:action DRIVE-TRUCK
  :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?truck ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
  :precondition
   (at ?airplane ?loc-from)
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem strips-log-x-1)
   (:domain logistics)
   (:objects 
   package6 package5 package4 package3 package2 package1 - package
   ARIZONA PENNSYLVANIA FLORIDA LOUISIANA UTAH NEBRASKA - city
   truck6 truck5 truck4 truck3 truck2 truck1 - truck
   plane2 plane1 - airplane
   KTUS KEWR KMIA KMLU KSLC KOMA - airport
   WF_Flagstaff_AZ warehouse_Hazleton warehouse_Ruskin Alexandria_Plant Bear_River_City_Plant Aurora_Plant WF_Lincoln_NE WF_Lafayette_LA WF_Allentown_PA - location
   )
   (:init 
          (in-city KTUS ARIZONA)
          (in-city WF_Flagstaff_AZ ARIZONA)
          (in-city KEWR PENNSYLVANIA)
          (in-city warehouse_Hazleton PENNSYLVANIA)
          (in-city WF_Allentown_PA PENNSYLVANIA)
          (in-city KMIA FLORIDA)
          (in-city warehouse_Ruskin FLORIDA)
          (in-city KMLU LOUISIANA)
          (in-city Alexandria_Plant LOUISIANA)
          (in-city WF_Lafayette_LA LOUISIANA)
          (in-city KSLC UTAH)
          (in-city Bear_River_City_Plant UTAH)
          (in-city KOMA NEBRASKA)
          (in-city Aurora_Plant NEBRASKA)
          (in-city WF_Lincoln_NE NEBRASKA)
          (at plane2 KMLU)
          (at plane1 KMIA)
          (at truck6 WF_Flagstaff_AZ)
          (at truck5 warehouse_Hazleton)
          (at truck4 warehouse_Ruskin)
          (at truck3 Alexandria_Plant)
          (at truck2 Bear_River_City_Plant)
          (at truck1 Aurora_Plant)
          (at package6 warehouse_Hazleton)
          (at package5 warehouse_Ruskin)
          (at package4 Alexandria_Plant)
          (at package3 Alexandria_Plant)
          (at package2 Bear_River_City_Plant)
          (at package1 Aurora_Plant))
   (:goal (and (at package6 WF_Lincoln_NE)
               (at package5 WF_Lafayette_LA)
               (at package4 warehouse_Ruskin)
               (at package3 WF_Allentown_PA)
               (at package2 WF_Allentown_PA)
               (at package1 WF_Flagstaff_AZ))))

; plan
1. (load-truck package6 truck5 warehouse_hazleton)
   deleted: (at package6 warehouse_hazleton)
   added: (in package6 truck5)
   goals met: 0 of 6
2. (drive-truck truck5 warehouse_hazleton kewr pennsylvania)
   deleted: (at truck5 warehouse_hazleton)
   added: (at truck5 kewr)
   goals met: 0 of 6
3. (unload-truck package6 truck5 kewr)
   deleted: (in package6 truck5)
   added: (at package6 kewr)
   goals met: 0 of 6
4. (load-truck package5 truck4 warehouse_ruskin)
   deleted: (at package5 warehouse_ruskin)
   added: (in package5 truck4)
   goals met: 0 of 6
5. (load-truck package4 truck3 alexandria_plant)
   deleted: (at package4 alexandria_plant)
   added: (in package4 truck3)
   goals met: 0 of 6
6. (load-truck package3 truck3 alexandria_plant)
   deleted: (at package3 alexandria_plant)
   added: (in package3 truck3)
   goals met: 0 of 6
7. (drive-truck truck3 alexandria_plant kmlu louisiana)
   deleted: (at truck3 alexandria_plant)
   added: (at truck3 kmlu)
   goals met: 0 of 6
8. (unload-truck package4 truck3 kmlu)
   deleted: (in package4 truck3)
   added: (at package4 kmlu)
   goals met: 0 of 6
9. (unload-truck package3 truck3 kmlu)
   deleted: (in package3 truck3)
   added: (at package3 kmlu)
   goals met: 0 of 6
10. (load-truck package2 truck2 bear_river_city_plant)
   deleted: (at package2 bear_river_city_plant)
   added: (in package2 truck2)
   goals met: 0 of 6
11. (drive-truck truck2 bear_river_city_plant kslc utah)
   deleted: (at truck2 bear_river_city_plant)
   added: (at truck2 kslc)
   goals met: 0 of 6
12. (unload-truck package2 truck2 kslc)
   deleted: (in package2 truck2)
   added: (at package2 kslc)
   goals met: 0 of 6
13. (load-truck package1 truck1 aurora_plant)
   deleted: (at package1 aurora_plant)
   added: (in package1 truck1)
   goals met: 0 of 6
14. (drive-truck truck1 aurora_plant koma nebraska)
   deleted: (at truck1 aurora_plant)
   added: (at truck1 koma)
   goals met: 0 of 6
15. (unload-truck package1 truck1 koma)
   deleted: (in package1 truck1)
   added: (at package1 koma)
   goals met: 0 of 6
16. (load-airplane package3 plane2 kmlu)
   deleted: (at package3 kmlu)
   added: (in package3 plane2)
   goals met: 0 of 6
17. (fly-airplane plane2 kmlu kslc)
   deleted: (at plane2 kmlu)
   added: (at plane2 kslc)
   goals met: 0 of 6
18. (load-airplane package2 plane2 kslc)
   deleted: (at package2 kslc)
   added: (in package2 plane2)
   goals met: 0 of 6
19. (fly-airplane plane2 kslc kewr)
   deleted: (at plane2 kslc)
   added: (at plane2 kewr)
   goals met: 0 of 6
20. (load-airplane package6 plane2 kewr)
   deleted: (at package6 kewr)
   added: (in package6 plane2)
   goals met: 0 of 6
21. (unload-airplane package3 plane2 kewr)
   deleted: (in package3 plane2)
   added: (at package3 kewr)
   goals met: 0 of 6
22. (load-truck package3 truck5 kewr)
   deleted: (at package3 kewr)
   added: (in package3 truck5)
   goals met: 0 of 6
23. (unload-airplane package2 plane2 kewr)
   deleted: (in package2 plane2)
   added: (at package2 kewr)
   goals met: 0 of 6
24. (load-truck package2 truck5 kewr)
   deleted: (at package2 kewr)
   added: (in package2 truck5)
   goals met: 0 of 6
25. (drive-truck truck5 kewr wf_allentown_pa pennsylvania)
   deleted: (at truck5 kewr)
   added: (at truck5 wf_allentown_pa)
   goals met: 0 of 6
26. (unload-truck package3 truck5 wf_allentown_pa)
   deleted: (in package3 truck5)
   added: (at package3 wf_allentown_pa)
   goals met: 1 of 6
27. (unload-truck package2 truck5 wf_allentown_pa)
   deleted: (in package2 truck5)
   added: (at package2 wf_allentown_pa)
   goals met: 2 of 6
28. (fly-airplane plane2 kewr koma)
   deleted: (at plane2 kewr)
   added: (at plane2 koma)
   goals met: 2 of 6
29. (unload-airplane package6 plane2 koma)
   deleted: (in package6 plane2)
   added: (at package6 koma)
   goals met: 2 of 6
30. (load-truck package6 truck1 koma)
   deleted: (at package6 koma)
   added: (in package6 truck1)
   goals met: 2 of 6
31. (drive-truck truck1 koma wf_lincoln_ne nebraska)
   deleted: (at truck1 koma)
   added: (at truck1 wf_lincoln_ne)
   goals met: 2 of 6
32. (unload-truck package6 truck1 wf_lincoln_ne)
   deleted: (in package6 truck1)
   added: (at package6 wf_lincoln_ne)
   goals met: 3 of 6
33. (load-airplane package1 plane2 koma)
   deleted: (at package1 koma)
   added: (in package1 plane2)
   goals met: 3 of 6
34. (fly-airplane plane2 koma ktus)
   deleted: (at plane2 koma)
   added: (at plane2 ktus)
   goals met: 3 of 6
35. (unload-airplane package1 plane2 ktus)
   deleted: (in package1 plane2)
   added: (at package1 ktus)
   goals met: 3 of 6
36. (drive-truck truck4 warehouse_ruskin kmia florida)
   deleted: (at truck4 warehouse_ruskin)
   added: (at truck4 kmia)
   goals met: 3 of 6
37. (unload-truck package5 truck4 kmia)
   deleted: (in package5 truck4)
   added: (at package5 kmia)
   goals met: 3 of 6
38. (load-airplane package5 plane1 kmia)
   deleted: (at package5 kmia)
   added: (in package5 plane1)
   goals met: 3 of 6
39. (fly-airplane plane1 kmia kmlu)
   deleted: (at plane1 kmia)
   added: (at plane1 kmlu)
   goals met: 3 of 6
40. (unload-airplane package5 plane1 kmlu)
   deleted: (in package5 plane1)
   added: (at package5 kmlu)
   goals met: 3 of 6
41. (load-truck package5 truck3 kmlu)
   deleted: (at package5 kmlu)
   added: (in package5 truck3)
   goals met: 3 of 6
42. (drive-truck truck3 kmlu wf_lafayette_la louisiana)
   deleted: (at truck3 kmlu)
   added: (at truck3 wf_lafayette_la)
   goals met: 3 of 6
43. (unload-truck package5 truck3 wf_lafayette_la)
   deleted: (in package5 truck3)
   added: (at package5 wf_lafayette_la)
   goals met: 4 of 6
44. (load-airplane package4 plane1 kmlu)
   deleted: (at package4 kmlu)
   added: (in package4 plane1)
   goals met: 4 of 6
45. (fly-airplane plane1 kmlu kmia)
   deleted: (at plane1 kmlu)
   added: (at plane1 kmia)
   goals met: 4 of 6
46. (unload-airplane package4 plane1 kmia)
   deleted: (in package4 plane1)
   added: (at package4 kmia)
   goals met: 4 of 6
47. (load-truck package4 truck4 kmia)
   deleted: (at package4 kmia)
   added: (in package4 truck4)
   goals met: 4 of 6
48. (drive-truck truck4 kmia warehouse_ruskin florida)
   deleted: (at truck4 kmia)
   added: (at truck4 warehouse_ruskin)
   goals met: 4 of 6
49. (unload-truck package4 truck4 warehouse_ruskin)
   deleted: (in package4 truck4)
   added: (at package4 warehouse_ruskin)
   goals met: 5 of 6
50. (drive-truck truck6 wf_flagstaff_az ktus arizona)
   deleted: (at truck6 wf_flagstaff_az)
   added: (at truck6 ktus)
   goals met: 5 of 6
51. (load-truck package1 truck6 ktus)
   deleted: (at package1 ktus)
   added: (in package1 truck6)
   goals met: 5 of 6
52. (drive-truck truck6 ktus wf_flagstaff_az arizona)
   deleted: (at truck6 ktus)
   added: (at truck6 wf_flagstaff_az)
   goals met: 5 of 6
53. (unload-truck package1 truck6 wf_flagstaff_az)
   deleted: (in package1 truck6)
   added: (at package1 wf_flagstaff_az)
   goals met: 6 of 6
